In [29]:
# automatically reload changes we make to schools.py and ui.py
%load_ext autoreload
%autoreload 2

# load the demographic data
import pandas as pd
from nycschools import class_size, config, schools
data_dir = config.data_dir
import os
beds = schools.load_school_demographics().beds.unique()

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [58]:
df, ptr = class_size.get_class_22()
df.head()

/home/mxc/.virtualenvs/nycschools/lib/python3.10/site-packages/openpyxl/worksheet/header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")
/home/mxc/.virtualenvs/nycschools/lib/python3.10/site-packages/openpyxl/worksheet/header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")
/home/mxc/.virtualenvs/nycschools/lib/python3.10/site-packages/openpyxl/worksheet/header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")

,dbn,school_name,grade,program_type,students_n,classes_n,avg_class_size,min_class_size,max_class_size,dept,subject,ay
0,01M015,PS 015 ROBERTO CLEMENTE,K,G&T,11,1,11.0,11,11,Elementary,Elementary,2022
1,01M015,PS 015 ROBERTO CLEMENTE,K,ICT,25,1,25.0,25,25,Elementary,Elementary,2022
2,01M015,PS 015 ROBERTO CLEMENTE,1,G&T,14,1,14.0,14,14,Elementary,Elementary,2022
3,01M015,PS 015 ROBERTO CLEMENTE,1,ICT,17,1,17.0,17,17,Elementary,Elementary,2022
4,01M015,PS 015 ROBERTO CLEMENTE,2,G&T,7,1,7.0,7,7,Elementary,Elementary,2022

In [59]:
ict = df[df.dept.isnull() & (df.program_type == "ICT")]
# df.loc[ict, "dept"] = "ICT"
# df[df.program_type == "ICT"]
ict

,dbn,school_name,grade,program_type,students_n,classes_n,avg_class_size,min_class_size,max_class_size,dept,subject,ay
30,01M034,PS 034 FRANKLIN D ROOSEVELT,6,ICT,25,1,25.00000,25,25,NaN,NaN,2022
31,01M034,PS 034 FRANKLIN D ROOSEVELT,7,ICT,21,1,21.00000,21,21,NaN,NaN,2022
32,01M034,PS 034 FRANKLIN D ROOSEVELT,8,ICT,43,2,21.50000,19,24,NaN,NaN,2022
73,01M140,PS 140 NATHAN STRAUS,6,ICT,32,2,16.00000,15,17,NaN,NaN,2022
74,01M140,PS 140 NATHAN STRAUS,7,ICT,50,2,25.00000,25,25,NaN,NaN,2022
...,...,...,...,...,...,...,...,...,...,...,...,...
10971,32K383,JHS 383 PHILIPPA SCHUYLER,7,ICT,86,3,28.66666,27,30,NaN,NaN,2022
10973,32K383,JHS 383 PHILIPPA SCHUYLER,8,ICT,72,3,24.00000,22,26,NaN,NaN,2022
10989,32K562,EVERGREEN MIDDLE SCHOOL FOR URBAN EXPLORATION,6,ICT,37,2,18.50000,16,21,NaN,NaN,2022
10991,32K562,EVERGREEN MIDDLE SCHOOL FOR URBAN EXPLORATION,7,ICT,21,1,21.00000,21,21,NaN,NaN,2022
10993,32K562,EVERGREEN MIDDLE SCHOOL FOR URBAN EXPLORATION,8,ICT,24,1,24.00000,24,24,NaN,NaN,2022

In [40]:
d = os.path.join(data_dir, "avg-class-size.csv") # nysed class size data
data = pd.read_csv(d)
# data.grade.unique()
nysed = data[data.ENTITY_CD.isin(beds)]
nysed.columns = ['beds', 'school_name', 'ay', 'program_type', 'avg_class_size', 'data_reported']
df.grade.unique()

array(['K', 1, 2, 3, 4, 5, 6, 7, 8, 'K-8 SC', 'MS Core', 'HS Core'],
      dtype=object)

In [8]:
url = "https://infohub.nyced.org/docs/default-source/default-document-library/updated2023_avg_classsize_schl.xlsx"
xls = pd.read_excel(url, sheet_name=None)
# first sheet is k-8
k8 = xls["K-8 Avg"]
hs = xls["MS HS Avg"]
ptr = xls["PTR"]

df = pd.concat([k8, hs], axis=0)
df["ay"] = 2022

df.columns = ['dbn', 'school_name', 'grade', 'program_type',
              'students_n', 'classes_n', 'avg_class_size',
              'min_class_size', 'max_class_size', 'dept', 'subject',
              'ay']

df.head()

/home/mxc/.virtualenvs/nycschools/lib/python3.10/site-packages/openpyxl/worksheet/header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")
/home/mxc/.virtualenvs/nycschools/lib/python3.10/site-packages/openpyxl/worksheet/header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")
/home/mxc/.virtualenvs/nycschools/lib/python3.10/site-packages/openpyxl/worksheet/header_footer.py:48: UserWarning: Cannot parse header or footer so it will be ignored
  warn("""Cannot parse header or footer so it will be ignored""")

,dbn,school_name,grade,program_type,students_n,classes_n,avg_class_size,min_class_size,max_class_size,dept,subject,ay
0,01M015,PS 015 ROBERTO CLEMENTE,K,G&T,11,1,11.0,<15,<15,NaN,NaN,2022
1,01M015,PS 015 ROBERTO CLEMENTE,K,ICT,25,1,25.0,25,25,NaN,NaN,2022
2,01M015,PS 015 ROBERTO CLEMENTE,1,G&T,14,1,14.0,<15,<15,NaN,NaN,2022
3,01M015,PS 015 ROBERTO CLEMENTE,1,ICT,17,1,17.0,17,17,NaN,NaN,2022
4,01M015,PS 015 ROBERTO CLEMENTE,2,G&T,7,1,7.0,<15,<15,NaN,NaN,2022

In [10]:


# df = df.apply(lambda x: x["Number of Students"] if x["Min Class Size"] < 15 else x["Min Class Size"], axis=1)


# make Min Class Size the same as Number of Students if <15
def fix_class_size(row):
    if row.min_class_size == "<15":
        row.min_class_size = row.students_n
    if row.max_class_size == "<15":
        row.max_class_size = row.students_n

    return row


df = df.apply(fix_class_size, axis=1)
df.head()

,dbn,school_name,grade,program_type,students_n,classes_n,avg_class_size,min_class_size,max_class_size,dept,subject,ay
0,01M015,PS 015 ROBERTO CLEMENTE,K,G&T,11,1,11.0,11,11,NaN,NaN,2022
1,01M015,PS 015 ROBERTO CLEMENTE,K,ICT,25,1,25.0,25,25,NaN,NaN,2022
2,01M015,PS 015 ROBERTO CLEMENTE,1,G&T,14,1,14.0,14,14,NaN,NaN,2022
3,01M015,PS 015 ROBERTO CLEMENTE,1,ICT,17,1,17.0,17,17,NaN,NaN,2022
4,01M015,PS 015 ROBERTO CLEMENTE,2,G&T,7,1,7.0,7,7,NaN,NaN,2022